app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)
    @event.admin = current_admin
    if @event.save
---
INSERT INTO "events" ("name", "description", "date_time", "location", "created_at", "updated_at", "admin_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"